JohnDevine/ESP32-MQTT-Template/src/main.c
/*
 * ESP32 MQTT Weather Station with BH1750 Light Sensor
 * 
 * This project implements an ESP32-based weather monitoring station that reads
 * ambient light data from a BH1750 digital light sensor via I2C and publishes
 * the measurements to an MQTT broker.
 * 
 * FEATURES:
 * - BH1750 digital light sensor reading via I2C (GPIO21/SDA, GPIO22/SCL)
 * - MQTT connectivity with automatic reconnection handling
 * - WiFi configuration with captive portal for easy setup
 * - Web-based configuration interface for all parameters
 * - Watchdog timer for system reliability
 * - Persistent configuration storage (NVS)
 * - Automatic version management and build automation
 * 
 * HARDWARE REQUIREMENTS:
 * - ESP32 development board
 * - BH1750 digital light sensor (I2C interface)
 * - Pull-up resistors for I2C lines (typically 4.7kΩ)
 * 
 * DATA OUTPUT:
 * - Light intensity in lux (floating point)
 * - Sensor status and processor metrics
 * - JSON format via MQTT for integration with home automation systems
 */

/*
 * CONDITIONAL LOGGING CONFIGURATION
 * 
 * To enable debug logging for this specific file, uncomment the line below.
 * This allows ESP_LOGD() calls to be compiled in and displayed when the 
 * global log level is set to DEBUG or VERBOSE.
 * 
 * Log Levels (from highest to lowest priority):
 * - ESP_LOG_ERROR   (E) - Error conditions
 * - ESP_LOG_WARN    (W) - Warning conditions  
 * - ESP_LOG_INFO    (I) - Informational messages
 * - ESP_LOG_DEBUG   (D) - Debug messages
 * - ESP_LOG_VERBOSE (V) - Verbose debug messages
 * 
 * To set global log level in menuconfig:
 * Component config > Log output > Default log verbosity
 * 
 * To set at runtime: esp_log_level_set("*", ESP_LOG_DEBUG);
 */
// #define LOG_LOCAL_LEVEL ESP_LOG_DEBUG

// Standard C input/output library
#include <stdio.h>
// FreeRTOS real-time operating system definitions
#include "freertos/FreeRTOS.h"
// FreeRTOS task management
#include "freertos/task.h"
// ESP32 GPIO driver
#include "driver/gpio.h"
// ESP32 I2C master driver for BH1750 sensor (new driver)
#include "driver/i2c_master.h"
// ESP-IDF logging library
#include "esp_log.h"
// Standard C string manipulation library (for memcmp)
#include <string.h> 

// Added for Wi-Fi and MQTT
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "mqtt_client.h"
#include "cJSON.h" // For JSON formatting
#include "esp_spiffs.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_efuse.h"
#include "esp_http_server.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <errno.h>
#include "esp_chip_info.h"
#include "esp_ota_ops.h"
#include "esp_flash.h"
#include "spi_flash_mmap.h"
#include "project_version.h"  // Single source of truth for version
#include "esp_partition.h"
#include "esp_http_server.h"

// Watchdog timer includes
#include "esp_task_wdt.h"

// System monitoring includes
#include "esp_netif.h"

// Software watchdog variables
static uint32_t watchdog_timeout_ms = 0;  // Watchdog timeout (10× sample interval)
static TickType_t last_successful_publish = 0;  // Last successful MQTT publish time
static bool watchdog_enabled = false;  // Whether watchdog is enabled
static bool mqtt_publish_success = false;  // Flag for successful MQTT publish

// Debug logging flag - set to false to reduce log output (except watchdog logs)
static bool debug_logging = false;

#define WIFI_NVS_NAMESPACE "wifi_cfg"
#define WIFI_NVS_KEY_SSID "ssid"
#define WIFI_NVS_KEY_PASS "pass"
#define MQTT_NVS_KEY_URL "broker_url"
#define NVS_KEY_SAMPLE_INTERVAL "sample_interval"
#define NVS_KEY_DATA_TOPIC "data_topic"
#define NVS_KEY_WATCHDOG_COUNTER "watchdog_cnt"
#define DEFAULT_WIFI_SSID "yourSSID"
#define DEFAULT_WIFI_PASS "yourpassword"
// Temporary: Using public test broker - change this to your local broker once network is confirmed
#define DEFAULT_MQTT_BROKER_URL "mqtt://test.mosquitto.org:1883"
// Original: #define DEFAULT_MQTT_BROKER_URL "mqtt://192.168.1.100"
#define DEFAULT_SAMPLE_INTERVAL 5000L

static char wifi_ssid[33] = DEFAULT_WIFI_SSID;
static char wifi_pass[65] = DEFAULT_WIFI_PASS;
static char mqtt_broker_url[128] = DEFAULT_MQTT_BROKER_URL;
char data_topic[41] = "Data/BH1750";  // Default MQTT topic for BH1750 sensor data
static long sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
static uint32_t watchdog_reset_counter = 0;  // Watchdog timer reset counter

#define BOOT_BTN_GPIO GPIO_NUM_0

// I2C configuration for BH1750 light sensor (new I2C master driver)
#define I2C_MASTER_SCL_IO           GPIO_NUM_22    // SCL GPIO pin
#define I2C_MASTER_SDA_IO           GPIO_NUM_21    // SDA GPIO pin
#define I2C_MASTER_FREQ_HZ          100000         // I2C master clock frequency (100kHz)
#define I2C_MASTER_TIMEOUT_MS       1000

// BH1750 sensor configuration
#define BH1750_ADDR                 0x23           // BH1750 I2C address (ADDR pin low)
#define BH1750_CMD_POWER_ON         0x01           // Power on command
#define BH1750_CMD_POWER_DOWN       0x00           // Power down command
#define BH1750_CMD_RESET            0x07           // Reset command
#define BH1750_CMD_CONT_HIGH_RES    0x10           // Continuous H-Resolution mode
#define BH1750_CMD_CONT_HIGH_RES2   0x11           // Continuous H-Resolution mode2
#define BH1750_CMD_CONT_LOW_RES     0x13           // Continuous L-Resolution mode
#define BH1750_CMD_ONE_HIGH_RES     0x20           // One Time H-Resolution mode
#define BH1750_CMD_ONE_HIGH_RES2    0x21           // One Time H-Resolution mode2
#define BH1750_CMD_ONE_LOW_RES      0x23           // One Time L-Resolution mode

// I2C master bus and device handles (new I2C driver)
static i2c_master_bus_handle_t i2c_bus_handle;
static i2c_master_dev_handle_t bh1750_dev_handle;

// Tag used for logging messages from this module
static const char *TAG = "DATA_READER";

// Wi-Fi Configuration
#define EXAMPLE_ESP_MAXIMUM_RETRY  5

// MQTT Configuration
#define MQTT_BROKER_URL "mqtt://192.168.1.5"

