JohnDevine/ESP32-MQTT-Template/src/main.c
// Global variable for MQTT client
static esp_mqtt_client_handle_t mqtt_client;
static int wifi_retry_num = 0;

// BH1750 sensor data structure
// Replace this with your specific data structure
typedef struct {
    // PutInputCodeHere: Define your data structure fields here
    // BH1750 light sensor data
    float sunlight;  // Light intensity in lux
    bool sensor_ok;  // Sensor status flag
    // Add your specific data fields here
} input_data_t;

// Global instance of input data
static input_data_t current_input_data;


// PutInputCodeHere: Define your protocol-specific data structures here
// Example: If you need to store parsed fields from your input data
// typedef struct {
//     uint8_t id;
//     uint32_t value;
//     char strval[48];
//     int is_ascii;
// } parsed_field_t;
// #define MAX_PARSED_FIELDS 32
// static parsed_field_t parsed_fields[MAX_PARSED_FIELDS];
// static int parsed_fields_count = 0;

// Forward declarations for functions defined later in this file

// Forward declarations for NVS functions
static void load_watchdog_counter_from_nvs(void);
static void save_watchdog_counter_to_nvs(void);

// Forward declaration for DNS hijack task
void dns_hijack_task(void *pvParameter);

void url_decode(char *dst, const char *src, size_t dstsize);

// Forward declarations for HTTP handlers
static esp_err_t params_json_get_handler(httpd_req_t *req);
static esp_err_t params_update_post_handler(httpd_req_t *req);
static esp_err_t parameters_html_handler(httpd_req_t *req);
static esp_err_t captive_redirect_handler(httpd_req_t *req);
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req);
static esp_err_t ota_firmware_handler(httpd_req_t *req);
static esp_err_t ota_filesystem_handler(httpd_req_t *req);

// New forward declarations for Wi-Fi and MQTT
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data);
static void mqtt_event_handler(void* arg, esp_event_base_t event_base,
                               int32_t event_id, void* event_data);
static bool test_mqtt_broker_connectivity(const char* broker_url);
static bool check_wifi_connection(void);
void wifi_init_sta(void);
static void mqtt_app_start(void);
void publish_input_data_mqtt(const input_data_t *input_data_ptr); // Publish sensor data to MQTT

// Forward declaration for DNS hijack task
void dns_hijack_task(void *pvParameter);

// Helper function to extract a 16-bit unsigned integer from a buffer.
// Assumes big-endian byte order (most significant byte first).
// buffer: Pointer to the byte array.
// offset: Starting index in the buffer from where to read the 16-bit integer.
// Returns the extracted 16-bit unsigned integer.
uint16_t unpack_u16_be(const uint8_t *buffer, int offset) {
    // Combine two consecutive bytes into a 16-bit value.
    // buffer[offset] is the most significant byte, buffer[offset+1] is the least significant.
    return ((uint16_t)buffer[offset] << 8) | buffer[offset + 1];
}

// Helper function to extract an 8-bit unsigned integer (a single byte) from a buffer.
// buffer: Pointer to the byte array.
// offset: Index in the buffer from where to read the 8-bit integer.
// Returns the extracted 8-bit unsigned integer.
uint8_t unpack_u8(const uint8_t *buffer, int offset) {
    // Directly return the byte at the specified offset.
    return buffer[offset];
}

// I2C Master initialization for BH1750 sensor (new I2C master driver)
static esp_err_t init_i2c_master(void) {
    // Configure I2C master bus
    i2c_master_bus_config_t i2c_bus_config = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .scl_io_num = I2C_MASTER_SCL_IO,
        .sda_io_num = I2C_MASTER_SDA_IO,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };

    esp_err_t err = i2c_new_master_bus(&i2c_bus_config, &i2c_bus_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "I2C bus creation failed: %s", esp_err_to_name(err));
        return err;
    }

    // Configure BH1750 device
    i2c_device_config_t bh1750_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = BH1750_ADDR,
        .scl_speed_hz = I2C_MASTER_FREQ_HZ,
    };

    err = i2c_master_bus_add_device(i2c_bus_handle, &bh1750_cfg, &bh1750_dev_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "BH1750 device add failed: %s", esp_err_to_name(err));
        return err;
    }

    ESP_LOGI(TAG, "I2C master initialized successfully");
    return ESP_OK;
}

// BH1750 sensor initialization (new I2C master driver)
static esp_err_t bh1750_init(void) {
    esp_err_t ret;
    uint8_t cmd_data;

    // Power on the sensor
    cmd_data = BH1750_CMD_POWER_ON;
    ret = i2c_master_transmit(bh1750_dev_handle, &cmd_data, 1, I2C_MASTER_TIMEOUT_MS);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "BH1750 power on failed: %s", esp_err_to_name(ret));
        return ret;
    }

    vTaskDelay(pdMS_TO_TICKS(10)); // Wait for power on

    // Set measurement mode to continuous high resolution
    cmd_data = BH1750_CMD_CONT_HIGH_RES;
    ret = i2c_master_transmit(bh1750_dev_handle, &cmd_data, 1, I2C_MASTER_TIMEOUT_MS);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "BH1750 mode set failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ESP_LOGI(TAG, "BH1750 sensor initialized successfully");
    vTaskDelay(pdMS_TO_TICKS(120)); // Wait for first measurement (120ms for high res mode)
    return ESP_OK;
}

// Read light intensity from BH1750 sensor (new I2C master driver)
static esp_err_t bh1750_read_light(float *lux) {
    esp_err_t ret;
    uint8_t data[2];

    // Read 2 bytes of data from BH1750
    ret = i2c_master_receive(bh1750_dev_handle, data, 2, I2C_MASTER_TIMEOUT_MS);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "BH1750 read failed: %s", esp_err_to_name(ret));
        *lux = -1.0f; // Error value
        return ret;
    }

    // Convert the raw data to lux
    uint16_t raw_data = (data[0] << 8) | data[1];
    *lux = raw_data / 1.2f;  // Resolution: 1 lux per 1.2 counts

