JohnDevine/ESP32-MQTT-Template/src/main.c
    ESP_LOGD(TAG, "BH1750 raw data: %d, lux: %.1f", raw_data, *lux);
    return ESP_OK;
}

// BH1750 sensor reading function
// PutInputCodeHere: Replace this function with your specific input reading logic
static bool read_input_data() {
    ESP_LOGI(TAG, "Reading BH1750 light sensor data...");
    
    // Initialize input data fields to default/invalid values
    current_input_data.sunlight = 0.0f;
    current_input_data.sensor_ok = false;
    
    // PutInputCodeHere: Read from BH1750 I2C sensor
    float lux_value;
    esp_err_t ret = bh1750_read_light(&lux_value);
    
    if (ret == ESP_OK && lux_value >= 0) {
        current_input_data.sunlight = lux_value;
        current_input_data.sensor_ok = true;
        ESP_LOGI(TAG, "BH1750 reading successful: %.1f lux", lux_value);
        
        // Publish MQTT data only on successful sensor read
        publish_input_data_mqtt(&current_input_data);
        ESP_LOGI(TAG, "MQTT data published after successful sensor read");
        return true;
    } else {
        current_input_data.sunlight = -1.0f;  // Error value
        current_input_data.sensor_ok = false;
        ESP_LOGE(TAG, "BH1750 reading failed - skipping MQTT publish");
        return false;
    }
}

// Place these functions before app_main so they are visible to it
void load_wifi_config_from_nvs() {
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        size_t ssid_len = sizeof(wifi_ssid);
        size_t pass_len = sizeof(wifi_pass);
        if (nvs_get_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid, &ssid_len) != ESP_OK) {
            strncpy(wifi_ssid, DEFAULT_WIFI_SSID, sizeof(wifi_ssid)-1);
            nvs_set_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid);
        }
        if (nvs_get_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass, &pass_len) != ESP_OK) {
            strncpy(wifi_pass, DEFAULT_WIFI_PASS, sizeof(wifi_pass)-1);
            nvs_set_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass);
        }
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    } else {
        strncpy(wifi_ssid, DEFAULT_WIFI_SSID, sizeof(wifi_ssid)-1);
        strncpy(wifi_pass, DEFAULT_WIFI_PASS, sizeof(wifi_pass)-1);
    }
}

void load_mqtt_config_from_nvs() {
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        size_t url_len = sizeof(mqtt_broker_url);
        if (nvs_get_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url, &url_len) != ESP_OK) {
            strncpy(mqtt_broker_url, DEFAULT_MQTT_BROKER_URL, sizeof(mqtt_broker_url)-1);
            nvs_set_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url);
        }
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    } else {
        strncpy(mqtt_broker_url, DEFAULT_MQTT_BROKER_URL, sizeof(mqtt_broker_url)-1);
    }
}

void load_sample_interval_from_nvs() {
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        int64_t val = 0;
        if (nvs_get_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, &val) == ESP_OK && val > 0) {
            sample_interval_ms = (long)val;
        } else {
            sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
            nvs_set_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, (int64_t)sample_interval_ms);
        }
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    } else {
        sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
    }
}

void load_data_topic_from_nvs() {
    ESP_LOGI(TAG, "=== LOADING DATA TOPIC FROM NVS ===");
    ESP_LOGI(TAG, "Initial data_topic value: '%s'", data_topic);
    
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    ESP_LOGI(TAG, "NVS open result: %s", esp_err_to_name(err));
    
    if (err == ESP_OK) {
        size_t topic_len = sizeof(data_topic);
        ESP_LOGI(TAG, "Attempting to read NVS key '%s', buffer size: %d", NVS_KEY_DATA_TOPIC, topic_len);
        
        esp_err_t get_err = nvs_get_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic, &topic_len);
        ESP_LOGI(TAG, "NVS get_str result: %s", esp_err_to_name(get_err));
        
        if (get_err != ESP_OK) {
            ESP_LOGW(TAG, "Data topic not found in NVS (error: %s), using default: Data/BH1750", esp_err_to_name(get_err));
            strncpy(data_topic, "Data/BH1750", sizeof(data_topic)-1);
            data_topic[sizeof(data_topic)-1] = '\0';
            esp_err_t set_err = nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic);
            ESP_LOGI(TAG, "Default Data topic save result: %s", esp_err_to_name(set_err));
            nvs_commit(nvs_handle);
        } else {
            ESP_LOGI(TAG, "Successfully loaded Data topic from NVS: '%s' (length: %d)", data_topic, topic_len);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for Data topic: %s", esp_err_to_name(err));
        strncpy(data_topic, "Data/BH1750", sizeof(data_topic)-1);
        data_topic[sizeof(data_topic)-1] = '\0';
    }
    ESP_LOGI(TAG, "=== FINAL DATA TOPIC: '%s' ===", data_topic);
}

void save_data_topic_to_nvs(const char *topic) {
    nvs_handle_t nvs_handle;
    if (nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle) == ESP_OK) {
        nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, topic);
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    }
}

void load_watchdog_counter_from_nvs() {
    ESP_LOGI(TAG, "=== LOADING WATCHDOG COUNTER FROM NVS ===");
    ESP_LOGI(TAG, "Initial watchdog_reset_counter value: %lu", watchdog_reset_counter);
    
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    ESP_LOGI(TAG, "NVS open result: %s", esp_err_to_name(err));
    
    if (err == ESP_OK) {
        uint32_t val = 0;
        esp_err_t get_err = nvs_get_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, &val);
        ESP_LOGI(TAG, "NVS get_u32 result: %s", esp_err_to_name(get_err));
        
        if (get_err == ESP_OK) {
            watchdog_reset_counter = val;
            ESP_LOGI(TAG, "Successfully loaded watchdog counter from NVS: %lu", watchdog_reset_counter);
        } else {
            ESP_LOGW(TAG, "Watchdog counter not found in NVS (error: %s), using default: 0", esp_err_to_name(get_err));
            watchdog_reset_counter = 0;
            esp_err_t set_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
            ESP_LOGI(TAG, "Default watchdog counter save result: %s", esp_err_to_name(set_err));
            nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for watchdog counter: %s", esp_err_to_name(err));
        watchdog_reset_counter = 0;
    }
    ESP_LOGI(TAG, "=== FINAL WATCHDOG COUNTER: %lu ===", watchdog_reset_counter);
}

void save_watchdog_counter_to_nvs() {
    ESP_LOGI(TAG, "=== SAVING WATCHDOG COUNTER TO NVS ===");
    ESP_LOGI(TAG, "Saving watchdog_reset_counter: %lu", watchdog_reset_counter);
    
