JohnDevine/ESP32-MQTT-Template/src/main.c
    // Handle preflight requests
    if (req->method == HTTP_OPTIONS) {
        httpd_resp_send(req, NULL, 0);
        return ESP_OK;
    }
    
    const esp_partition_t *spiffs_partition = NULL;
    esp_err_t err = ESP_OK;
    char *buf = NULL;
    const size_t buffer_size = 2048;  // Reduced buffer size for better memory management
    int received = 0;
    int remaining = req->content_len;

    ESP_LOGI(TAG, "Starting OTA filesystem update, size: %d bytes", remaining);
    
    // Allocate buffer on heap to avoid stack overflow
    buf = malloc(buffer_size);
    if (!buf) {
        ESP_LOGE(TAG, "Failed to allocate %d bytes for upload buffer", buffer_size);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Memory allocation failed");
        return ESP_FAIL;
    }

    // Find SPIFFS partition
    spiffs_partition = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_SPIFFS, NULL);
    if (!spiffs_partition) {
        ESP_LOGE(TAG, "No SPIFFS partition found");
        free(buf);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No SPIFFS partition found");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Erasing SPIFFS partition at offset 0x%lx, size: %lu bytes", 
             spiffs_partition->address, spiffs_partition->size);

    // Erase the partition first
    err = esp_partition_erase_range(spiffs_partition, 0, spiffs_partition->size);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to erase SPIFFS partition: %s", esp_err_to_name(err));
        free(buf);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to erase SPIFFS partition");
        return ESP_FAIL;
    }

    // Write filesystem data
    size_t offset = 0;
    int timeout_count = 0;
    int zero_recv_count = 0;
    int last_fs_progress = -1;  // Move static variable to local scope
    
    while (remaining > 0) {
        int chunk_size = (remaining < buffer_size) ? remaining : buffer_size;
        int recv_len = httpd_req_recv(req, buf, chunk_size);
        
        if (recv_len < 0) {
            if (recv_len == HTTPD_SOCK_ERR_TIMEOUT) {
                timeout_count++;
                ESP_LOGW(TAG, "Socket timeout #%d, continuing... (%d bytes remaining)", timeout_count, remaining);
                if (timeout_count > 15) {  // Increased tolerance for large files
                    ESP_LOGE(TAG, "Too many timeouts, aborting");
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_408_REQ_TIMEOUT, "Upload timeout - too many socket timeouts");
                    return ESP_FAIL;
                }
                vTaskDelay(pdMS_TO_TICKS(200));  // Longer delay for large file processing
                continue;
            }
            ESP_LOGE(TAG, "File reception failed with error: %d", recv_len);
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File reception failed - connection error");
            return ESP_FAIL;
        }
        
        if (recv_len == 0) {
            zero_recv_count++;
            ESP_LOGW(TAG, "Received 0 bytes #%d, continuing... (%d bytes remaining)", zero_recv_count, remaining);
            if (zero_recv_count > 8) {  // Increased tolerance for large files
                ESP_LOGE(TAG, "Too many zero-byte receives, connection likely closed");
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Connection closed unexpectedly");
                return ESP_FAIL;
            }
            vTaskDelay(pdMS_TO_TICKS(100));  // Longer delay before retry
            continue;
        }
        
        // Reset counters on successful receive
        timeout_count = 0;
        zero_recv_count = 0;

        err = esp_partition_write(spiffs_partition, offset, buf, recv_len);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "esp_partition_write failed: %s", esp_err_to_name(err));
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Partition write failed - flash error");
            return ESP_FAIL;
        }

        received += recv_len;
        remaining -= recv_len;
        offset += recv_len;
        
        // Log progress every 5% for large files
        int progress = (received * 100) / req->content_len;
        if (progress != last_fs_progress && progress % 5 == 0) {
            ESP_LOGI(TAG, "SPIFFS Progress: %d%% (%d/%d bytes, free heap: %lu)", 
                     progress, received, req->content_len, (unsigned long)esp_get_free_heap_size());
            last_fs_progress = progress;
        }
        
        // Yield to other tasks periodically for large uploads
        if ((received % (buffer_size * 4)) == 0) {
            vTaskDelay(pdMS_TO_TICKS(10));  // Brief yield every ~8KB
        }
    }

    free(buf);  // Clean up allocated buffer
    ESP_LOGI(TAG, "OTA filesystem update successful, rebooting...");
    httpd_resp_sendstr(req, "Filesystem Update Successful! Rebooting...");
    
    // Reboot after a short delay
    vTaskDelay(pdMS_TO_TICKS(1000));
    esp_restart();
    
    return ESP_OK;
}



static void start_ap_and_captive_portal() {
    ESP_LOGI(TAG, "Starting AP and captive portal...");
    
    // Start AP mode only for configuration (no STA mode to avoid connection attempts)
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    
    // Set to AP mode only - do not enable STA to avoid connection attempts
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
    ESP_LOGI(TAG, "WiFi set to AP mode only for configuration");
    
    // Configure AP with a unique name based on MAC address
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_SOFTAP);
    char ap_ssid[32];
    snprintf(ap_ssid, sizeof(ap_ssid), "ESP32-CONFIG-%02X%02X", mac[4], mac[5]);
    
    wifi_config_t ap_config = {
        .ap = {
            .ssid_len = 0,
            .password = "",
            .max_connection = 4,
            .authmode = WIFI_AUTH_OPEN,
            .beacon_interval = 100
        }
    };
    strncpy((char*)ap_config.ap.ssid, ap_ssid, sizeof(ap_config.ap.ssid));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &ap_config));

    // Set AP IP and DHCP
    esp_netif_t *ap_netif = esp_netif_create_default_wifi_ap();
    
