JohnDevine/ESP32-MQTT-Template/src/main.c
    // Stop DHCP server before configuring IP
    esp_netif_dhcps_stop(ap_netif);
    
    esp_netif_ip_info_t ip_info;
    ip_info.ip.addr = esp_ip4addr_aton("192.168.4.1");
    ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
    ip_info.gw.addr = esp_ip4addr_aton("192.168.4.1");
    ESP_ERROR_CHECK(esp_netif_set_ip_info(ap_netif, &ip_info));
    
    // Configure DHCP server options
    esp_netif_dhcps_option(ap_netif, ESP_NETIF_OP_SET, ESP_NETIF_DOMAIN_NAME_SERVER, &ip_info.ip, sizeof(ip_info.ip));
    
    esp_netif_dhcps_start(ap_netif);

    ESP_ERROR_CHECK(esp_wifi_start());
    ESP_LOGI(TAG, "WiFi AP started: %s (IP: 192.168.4.1)", ap_ssid);
    
    // Wait a moment for WiFi to stabilize
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    // Start SPIFFS
    ESP_LOGI(TAG, "About to call init_spiffs()...");
    init_spiffs();
    ESP_LOGI(TAG, "init_spiffs() completed successfully");
    
    // Start HTTP server
    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.uri_match_fn = httpd_uri_match_wildcard;
    config.max_uri_handlers = 16;  // Increase limit
    config.stack_size = 8192;      // Increase stack size
    
    // Configure for large file uploads (OTA)
    config.recv_wait_timeout = 120;     // 2 minutes timeout for receiving data
    config.send_wait_timeout = 120;     // 2 minutes timeout for sending data
    config.lru_purge_enable = true;     // Enable LRU purging of connections
    config.max_open_sockets = 4;        // Limit concurrent connections
    config.backlog_conn = 2;            // Reduce backlog
    
    ESP_LOGI(TAG, "HTTP server config: recv_timeout=%d, send_timeout=%d, max_sockets=%d", 
             config.recv_wait_timeout, config.send_wait_timeout, config.max_open_sockets);
    
    esp_err_t server_err = httpd_start(&server, &config);
    if (server_err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start HTTP server: %s", esp_err_to_name(server_err));
        return;
    }
    
    ESP_LOGI(TAG, "HTTP server started successfully");
    
    // Register handlers in order of specificity (most specific first)
    httpd_uri_t params_json = { .uri = "/params.json", .method = HTTP_GET, .handler = params_json_get_handler, .user_ctx = NULL };
    httpd_uri_t params_update = { .uri = "/update", .method = HTTP_POST, .handler = params_update_post_handler, .user_ctx = NULL };
    httpd_uri_t parameters_html = { .uri = "/parameters.html", .method = HTTP_GET, .handler = parameters_html_handler, .user_ctx = NULL };
    httpd_uri_t sysinfo_json = { .uri = "/sysinfo.json", .method = HTTP_GET, .handler = sysinfo_json_get_handler, .user_ctx = NULL };
    httpd_uri_t ota_firmware = { .uri = "/ota/firmware", .method = HTTP_POST, .handler = ota_firmware_handler, .user_ctx = NULL };
    httpd_uri_t ota_filesystem = { .uri = "/ota/filesystem", .method = HTTP_POST, .handler = ota_filesystem_handler, .user_ctx = NULL };
    httpd_uri_t ota_firmware_options = { .uri = "/ota/firmware", .method = HTTP_OPTIONS, .handler = ota_firmware_handler, .user_ctx = NULL };
    httpd_uri_t ota_filesystem_options = { .uri = "/ota/filesystem", .method = HTTP_OPTIONS, .handler = ota_filesystem_handler, .user_ctx = NULL };
    
    // Register specific handlers first
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &params_json));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &params_update));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &parameters_html));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &sysinfo_json));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_firmware));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_filesystem));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_firmware_options));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_filesystem_options));
    
    // Register wildcard handler last to catch all other requests
    httpd_uri_t captive = { .uri = "/*", .method = HTTP_GET, .handler = captive_redirect_handler, .user_ctx = NULL };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &captive));
    
    ESP_LOGI(TAG, "All HTTP handlers registered successfully");
    ESP_LOGI(TAG, "Captive portal ready - connect to '%s' and visit any website", ap_ssid);
}

void ap_config_task(void *pvParameter) {
    ESP_LOGI(TAG, "Starting AP configuration mode...");
    
    // Debug: Show watchdog counter before loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before NVS load (AP mode): %lu ***", watchdog_reset_counter);
    
    // Load NVS values before starting AP and HTTP server
    load_wifi_config_from_nvs();
    load_mqtt_config_from_nvs();
    load_sample_interval_from_nvs();
    load_data_topic_from_nvs();
    load_watchdog_counter_from_nvs();
    
    // Debug: Show watchdog counter after loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after NVS load (AP mode): %lu ***", watchdog_reset_counter);
    
    ESP_LOGI(TAG, "=== CONFIG LOADED FROM NVS (AP MODE) ===");
    ESP_LOGI(TAG, "WiFi SSID: %s", wifi_ssid);
    ESP_LOGI(TAG, "WiFi PASS: %s", wifi_pass);
    ESP_LOGI(TAG, "MQTT Broker URL: %s", mqtt_broker_url);
    ESP_LOGI(TAG, "Data Topic: %s", data_topic);
    ESP_LOGI(TAG, "Sample interval (ms): %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Watchdog reset counter: %lu", watchdog_reset_counter);
    ESP_LOGI(TAG, "=== STARTING AP CONFIG MODE ===");
    
    // Note: esp_netif_init() and esp_event_loop_create_default() 
    // are already called in main app initialization
    
    // Start the captive portal
    start_ap_and_captive_portal();
    
    // Wait a moment for the HTTP server to stabilize
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    // Start DNS hijack server for captive portal
    TaskHandle_t dns_task_handle = NULL;
    BaseType_t dns_task_result = xTaskCreate(dns_hijack_task, "dns_hijack_task", 4096, NULL, 4, &dns_task_handle);
    if (dns_task_result == pdPASS) {
        ESP_LOGI(TAG, "DNS hijack task started successfully");
    } else {
        ESP_LOGE(TAG, "Failed to create DNS hijack task");
    }
    
    ESP_LOGI(TAG, "AP configuration mode fully initialized");
    ESP_LOGI(TAG, "Connect to ESP32-CONFIG-XXXX network and visit any website to configure");
    
    vTaskDelete(NULL);
}

// Blink task for onboard LED
#define ONBOARD_LED_GPIO GPIO_NUM_2

// Blink the onboard LED for a short time (heartbeat)
void blink_heartbeat() {
    gpio_set_direction(ONBOARD_LED_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(ONBOARD_LED_GPIO, 1);
    vTaskDelay(pdMS_TO_TICKS(50));
    gpio_set_level(ONBOARD_LED_GPIO, 0);
}

// Main application entry point.
void app_main(void) {
    // ============================================================
    // REDUCE LOGGING OUTPUT - Uncomment one of these lines:
    // ============================================================
    esp_log_level_set("*", ESP_LOG_WARN);   // Show only warnings and errors
    // esp_log_level_set("*", ESP_LOG_INFO);   // Show info, warnings and errors (for debugging)
    // esp_log_level_set("*", ESP_LOG_ERROR);  // Show only errors
    // esp_log_level_set("*", ESP_LOG_NONE);   // Turn off all logging
    
    // Initialize NVS first for all code paths
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // Debug: Show initial watchdog counter value at app start
    ESP_LOGI(TAG, "*** DEBUG: Initial watchdog_reset_counter at app start: %lu ***", watchdog_reset_counter);

    // Configure Task Watchdog Timer
    ESP_LOGI(TAG, "Configuring Task Watchdog Timer...");
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = 30000, // 30 second timeout
        .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Monitor all cores
        .trigger_panic = true // Trigger panic on timeout
    };
    esp_err_t twdt_err = esp_task_wdt_init(&twdt_config);
    ESP_LOGI(TAG, "esp_task_wdt_init() returned: %d", twdt_err);
    // No esp_task_wdt_get_timeout() in ESP-IDF; cannot log actual timeout at runtime
    if (twdt_err == ESP_ERR_INVALID_STATE) {
        ESP_LOGI(TAG, "Task Watchdog Timer already initialized");
    } else {
        ESP_ERROR_CHECK(twdt_err);
        ESP_LOGI(TAG, "Task Watchdog Timer initialized successfully");
    }
    ESP_ERROR_CHECK(esp_task_wdt_add(NULL)); // Add current task to watchdog
    ESP_LOGI(TAG, "Task Watchdog Timer configured successfully");

    // Initialize network stack early for both AP and STA modes
    ESP_LOGI(TAG, "Initializing network stack...");
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_LOGI(TAG, "Network stack initialized successfully");

    ESP_LOGI(TAG, "Waiting 10 seconds for boot button press...");
    gpio_set_direction(BOOT_BTN_GPIO, GPIO_MODE_INPUT);
    bool boot_btn_pressed = false;
    for (int i = 0; i < 1000; ++i) { // 10 seconds, check every 10ms
        if (gpio_get_level(BOOT_BTN_GPIO) == 0) {
            boot_btn_pressed = true;
            ESP_LOGI(TAG, "Boot button press detected during wait!");
            break;
        }
        // Feed watchdog every 100 iterations (1 second)
        if (i % 100 == 0) {
            esp_task_wdt_reset();
        }
        vTaskDelay(10 / portTICK_PERIOD_MS);
    }
    ESP_LOGI(TAG, "Boot button wait finished, continuing startup...");
    if (boot_btn_pressed) {
        ESP_LOGI(TAG, "Entering AP config mode due to boot button press.");
        xTaskCreate(ap_config_task, "ap_config_task", 8192, NULL, 5, NULL);
        while (1) {
            esp_task_wdt_reset(); // Feed watchdog in config mode
            vTaskDelay(1000/portTICK_PERIOD_MS); // Block forever
        }
    }

