JohnDevine/ESP32-MQTT-Template/src/main.c
    // Initialize I2C communication for BH1750 sensor
    ESP_LOGI(TAG, "Initializing I2C master for BH1750 sensor...");
    esp_err_t i2c_err = init_i2c_master();
    if (i2c_err != ESP_OK) {
        ESP_LOGE(TAG, "I2C master initialization failed: %s", esp_err_to_name(i2c_err));
    } else {
        ESP_LOGI(TAG, "I2C master initialized successfully");
        
        // Initialize BH1750 sensor
        esp_err_t bh1750_err = bh1750_init();
        if (bh1750_err != ESP_OK) {
            ESP_LOGE(TAG, "BH1750 sensor initialization failed: %s", esp_err_to_name(bh1750_err));
        } else {
            ESP_LOGI(TAG, "BH1750 sensor initialized successfully");
        }
    }

    // Debug: Show watchdog counter before loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before NVS load (normal mode): %lu ***", watchdog_reset_counter);

    load_wifi_config_from_nvs();
    load_mqtt_config_from_nvs();
    load_sample_interval_from_nvs();
    load_data_topic_from_nvs();
    load_watchdog_counter_from_nvs();
    
    // Debug: Show watchdog counter after loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after NVS load (normal mode): %lu ***", watchdog_reset_counter);
    
    ESP_LOGI(TAG, "=== CONFIG LOADED FROM NVS ===");
    ESP_LOGI(TAG, "WiFi SSID: %s", wifi_ssid);
    ESP_LOGI(TAG, "WiFi PASS: %s", wifi_pass);
    ESP_LOGI(TAG, "MQTT Broker URL: %s", mqtt_broker_url);
    ESP_LOGI(TAG, "Data Topic: %s", data_topic);
    ESP_LOGI(TAG, "Sample interval (ms): %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Watchdog reset counter: %lu", watchdog_reset_counter);
    
    // Initialize SPIFFS for normal operation mode
    ESP_LOGI(TAG, "About to call init_spiffs() in normal mode...");
    init_spiffs();
    ESP_LOGI(TAG, "init_spiffs() completed successfully in normal mode");
    
    ESP_LOGI(TAG, "=== STARTING WIFI INIT ===");
    ESP_LOGI(TAG, "ESP_WIFI_MODE_STA");
    wifi_init_sta(); // Initialize Wi-Fi
    
    // Initialize software watchdog
    // Watchdog timeout is 10× sample interval (in ms), inactive if timeout ≤10,000 ms
    watchdog_timeout_ms = sample_interval_ms * 10;
    if (watchdog_timeout_ms > 10000) {
        watchdog_enabled = true;
        last_successful_publish = xTaskGetTickCount();
        ESP_LOGI(TAG, "Software watchdog enabled with timeout: %lu ms (10× sample interval)", watchdog_timeout_ms);
        ESP_LOGI(TAG, "WDT will reset ESP32 only if no MQTT data is published for %lu ms", watchdog_timeout_ms);
    } else {
        watchdog_enabled = false;
        ESP_LOGI(TAG, "Software watchdog inactive (timeout ≤10,000 ms, sample interval: %lu ms)", sample_interval_ms);
    }

    // Main loop to periodically read sensor data and publish to MQTT.
    while (1) {
        ESP_LOGD(TAG, "[MAIN LOOP] Start iteration");
        esp_task_wdt_reset();
        
        // Check software watchdog timeout - only triggers if no MQTT data published
        ESP_LOGD(TAG, "[MAIN LOOP] Check software watchdog");
        if (watchdog_enabled) {
            TickType_t current_time = xTaskGetTickCount();
            TickType_t elapsed_ms = pdTICKS_TO_MS(current_time - last_successful_publish);
            if (elapsed_ms >= watchdog_timeout_ms) {
                ESP_LOGE(TAG, "Software watchdog timeout! No successful MQTT publish in %lu ms (timeout: %lu ms)", elapsed_ms, watchdog_timeout_ms);
                
                // Debug: Show counter before increment
                ESP_LOGE(TAG, "*** DEBUG: watchdog_reset_counter BEFORE increment: %lu ***", watchdog_reset_counter);
                
                // Increment watchdog reset counter and save to NVS
                watchdog_reset_counter++;
                ESP_LOGE(TAG, "Incrementing watchdog reset counter to: %lu", watchdog_reset_counter);
                
                // Debug: Show counter after increment
                ESP_LOGE(TAG, "*** DEBUG: watchdog_reset_counter AFTER increment: %lu ***", watchdog_reset_counter);
                
                save_watchdog_counter_to_nvs();
                
                // Debug: Verify save by reloading from NVS
                uint32_t verify_counter = 0;
                nvs_handle_t verify_handle;
                esp_err_t verify_err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READONLY, &verify_handle);
                if (verify_err == ESP_OK) {
                    esp_err_t get_err = nvs_get_u32(verify_handle, NVS_KEY_WATCHDOG_COUNTER, &verify_counter);
                    ESP_LOGE(TAG, "*** DEBUG: Verification read from NVS result: %s, value: %lu ***", 
                             esp_err_to_name(get_err), verify_counter);
                    nvs_close(verify_handle);
                } else {
                    ESP_LOGE(TAG, "*** DEBUG: Failed to open NVS for verification: %s ***", esp_err_to_name(verify_err));
                }
                
                ESP_LOGE(TAG, "Forcing system restart...");
                vTaskDelay(pdMS_TO_TICKS(100));
                esp_restart();
            }
        }
        ESP_LOGD(TAG, "[MAIN LOOP] After software watchdog check");

        mqtt_publish_success = false;
        ESP_LOGD(TAG, "[MAIN LOOP] After reset mqtt_publish_success");

        // Read sensor data and attempt to publish if successful
        bool sensor_read_success = read_input_data();
        
        if (sensor_read_success) {
            ESP_LOGD(TAG, "[MAIN LOOP] Sensor read successful, data will be published to MQTT");
        } else {
            ESP_LOGW(TAG, "[MAIN LOOP] Sensor read failed, no MQTT data will be published this cycle");
        }
        ESP_LOGD(TAG, "[MAIN LOOP] After read_input_data");

        if (debug_logging) {
            ESP_LOGI(TAG, "Waiting %ld ms before next sensor read cycle...", sample_interval_ms);
        }
        if (sample_interval_ms > 5000) {
            uint32_t remaining_ms = sample_interval_ms;
            while (remaining_ms > 0) {
                uint32_t chunk_ms = (remaining_ms > 5000) ? 5000 : remaining_ms;
                vTaskDelay(pdMS_TO_TICKS(chunk_ms));
                esp_task_wdt_reset();
                remaining_ms -= chunk_ms;
            }
        } else {
            vTaskDelay(pdMS_TO_TICKS(sample_interval_ms));
        }
        ESP_LOGD(TAG, "[MAIN LOOP] End of iteration, feeding TWDT");
        esp_task_wdt_reset();
    }
}

// Wi-Fi Event Handler
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    printf("[WIFI] Event handler called: base=%s, event_id=%ld\n", event_base, event_id);
    
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        printf("[WIFI] WIFI_EVENT_STA_START - calling esp_wifi_connect()\n");
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        printf("[WIFI] WIFI_EVENT_STA_DISCONNECTED - retry_num=%d\n", wifi_retry_num);
        if (wifi_retry_num < EXAMPLE_ESP_MAXIMUM_RETRY) {
            esp_wifi_connect();
            wifi_retry_num++;
            printf("[WIFI] retry to connect to the AP\n");
        } else {
            printf("[WIFI] connect to the AP fail\n");
            printf("[WIFI] WiFi SSID used: %s\n", wifi_ssid);
            printf("[WIFI] WiFi Password used: %s\n", wifi_pass);
        }
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        printf("[WIFI] IP_EVENT_STA_GOT_IP received!\n");
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        printf("[WIFI] got ip:" IPSTR "\n", IP2STR(&event->ip_info.ip));
        printf("Obtained IP address: " IPSTR "\n", IP2STR(&event->ip_info.ip));
        wifi_retry_num = 0;
        // Start MQTT client once IP is obtained
        printf("[WIFI] About to start MQTT client...\n");
        mqtt_app_start();
        printf("[WIFI] MQTT client start function completed\n");
    } else {
        printf("[WIFI] Unhandled event: base=%s, event_id=%ld\n", event_base, event_id);
    }
    printf("[WIFI] Event handler completed\n");
}

// Wi-Fi Initialization
void wifi_init_sta(void)
{
    // Note: esp_netif_init() and esp_event_loop_create_default() 
    // are already called in main app initialization
    esp_netif_create_default_wifi_sta();

