JohnDevine/ESP32-MQTT-Template/src/main.c
    // Simple URL parsing - expect format mqtt://ip:port or mqtt://ip
    const char* ip_start = strstr(broker_url, "://");
    if (ip_start == NULL) {
        ESP_LOGE(TAG, "Invalid broker URL format: %s", broker_url);
        return false;
    }
    ip_start += 3;  // Skip past "://"
    
    // Find port separator
    const char* port_start = strchr(ip_start, ':');
    if (port_start != NULL) {
        // Extract IP
        size_t ip_len = port_start - ip_start;
        if (ip_len >= sizeof(ip_str)) ip_len = sizeof(ip_str) - 1;
        strncpy(ip_str, ip_start, ip_len);
        ip_str[ip_len] = '\0';
        
        // Extract port
        port = atoi(port_start + 1);
    } else {
        // No port specified, copy IP and use default port
        strncpy(ip_str, ip_start, sizeof(ip_str) - 1);
        ip_str[sizeof(ip_str) - 1] = '\0';
        
        // Remove any trailing slash or path
        char* slash = strchr(ip_str, '/');
        if (slash) *slash = '\0';
    }
    
    ESP_LOGI(TAG, "Testing connectivity to MQTT broker: %s:%d", ip_str, port);
    
    // Create a socket for testing
    int sock = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (sock < 0) {
        ESP_LOGE(TAG, "Failed to create socket for connectivity test");
        return false;
    }
    
    // Set socket timeout
    struct timeval timeout;
    timeout.tv_sec = 5;  // 5 second timeout
    timeout.tv_usec = 0;
    setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));
    setsockopt(sock, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout));
    
    // Setup address
    struct sockaddr_in dest_addr;
    dest_addr.sin_addr.s_addr = inet_addr(ip_str);
    dest_addr.sin_family = AF_INET;
    dest_addr.sin_port = htons(port);
    
    // Test connection
    int connect_result = connect(sock, (struct sockaddr *)&dest_addr, sizeof(dest_addr));
    close(sock);
    
    if (connect_result == 0) {
        ESP_LOGI(TAG, "✓ Connectivity test successful - broker is reachable");
        return true;
    } else {
        ESP_LOGE(TAG, "✗ Connectivity test failed - broker not reachable (error: %d, errno: %d)", connect_result, errno);
        printf("[MQTT] Broker connectivity test failed!\n");
        printf("[MQTT] Broker: %s:%d\n", ip_str, port);
        printf("[MQTT] Check your broker configuration:\n");
        printf("  1. Verify broker IP address is correct\n");
        printf("  2. Ensure broker is running and accessible\n");
        printf("  3. Check network connectivity\n");
        printf("  4. Verify port number (default MQTT: 1883)\n");
        return false;
    }
}

// MQTT Application Start
static void mqtt_app_start(void) {
    ESP_LOGI(TAG, "Starting MQTT client initialization...");
    
    // Check WiFi connection first
    if (!check_wifi_connection()) {
        ESP_LOGE(TAG, "WiFi not connected - cannot start MQTT client");
        printf("[MQTT] WiFi connection required before MQTT\n");
        return;
    }
    
    // Test broker connectivity
    if (!test_mqtt_broker_connectivity(mqtt_broker_url)) {
        ESP_LOGE(TAG, "MQTT broker connectivity test failed - skipping MQTT client start");
        printf("[MQTT] Broker not reachable - check configuration\n");
        return;
    }
    
    esp_mqtt_client_config_t mqtt_cfg = {
        .broker.address.uri = mqtt_broker_url,
        .network.timeout_ms = 10000,           // 10 second timeout
        .network.refresh_connection_after_ms = 20000,  // Refresh connection every 20s
        .session.keepalive = 60,               // 60 second keepalive
        .network.reconnect_timeout_ms = 10000, // 10 second reconnect timeout
        .buffer.size = 1024,                   // 1KB buffer
        .buffer.out_size = 1024,               // 1KB output buffer
    };
    // The event_handle field was removed from esp_mqtt_client_config_t in ESP-IDF v5.0.
    // Events are now registered globally for the client instance.
    // For older IDF: .event_handle = mqtt_event_handler,

    ESP_LOGI(TAG, "Initializing MQTT client with broker: %s", mqtt_broker_url);
    mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
    if (mqtt_client == NULL) {
        ESP_LOGE(TAG, "Failed to initialize MQTT client");
        return;
    }
    
    /* The last argument may be used to pass data to the event handler, in this example mqtt_event_handler */
    esp_mqtt_client_register_event(mqtt_client, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
    
    esp_err_t start_result = esp_mqtt_client_start(mqtt_client);
    if (start_result != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start MQTT client: %s", esp_err_to_name(start_result));
        return;
    }
    
    ESP_LOGI(TAG, "MQTT client started successfully.");
}

// Helper functions for processor metrics
static int32_t get_wifi_rssi_percent(void) {
    wifi_ap_record_t ap_info;
    esp_err_t ret = esp_wifi_sta_get_ap_info(&ap_info);
    if (ret == ESP_OK) {
        int32_t rssi_dbm = ap_info.rssi;
        // Convert RSSI from dBm to percentage
        // Typical range: -100 dBm (0%) to -50 dBm (100%)
        int32_t rssi_percent;
        if (rssi_dbm >= -50) {
            rssi_percent = 100;
        } else if (rssi_dbm <= -100) {
            rssi_percent = 0;
        } else {
            // Linear mapping: -100 dBm = 0%, -50 dBm = 100%
            rssi_percent = 2 * (rssi_dbm + 100);
        }
        return rssi_percent;
    }
    return 0; // Error value - 0% signal
}

static char* get_ip_address(void) {
    static char ip_str[16];
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (netif) {
        esp_netif_ip_info_t ip_info;
        esp_err_t ret = esp_netif_get_ip_info(netif, &ip_info);
        if (ret == ESP_OK) {
            snprintf(ip_str, sizeof(ip_str), IPSTR, IP2STR(&ip_info.ip));
            return ip_str;
        }
    }
    return "0.0.0.0";
}

static float get_cpu_temperature(void) {
    // ESP32 temperature reading is complex and requires additional configuration
    // For now, return a placeholder that could be enhanced later
    // Alternative: Use ADC reading from internal temperature sensor or external sensor
    return 25.0 + (esp_random() % 20); // Simulated temperature 25-45°C for demonstration
}

static char* get_software_version(void) {
    static char version_str[32];
    static bool version_loaded = false;
    
    if (!version_loaded) {
        // Use the CMake-generated version from project_version.h
        ESP_LOGI(TAG, "Using CMake-generated version: %s", PROJECT_VERSION);
        strncpy(version_str, PROJECT_VERSION, sizeof(version_str) - 1);
        version_str[sizeof(version_str) - 1] = '\0';
        version_loaded = true;
    }
    return version_str;
}

