JohnDevine/ESP32-MQTT-Template/src/main.c
static char* get_chip_id(void) {
    static char chip_id_str[13]; // 6 bytes * 2 hex chars + null terminator
    static bool chip_id_loaded = false;
    
    if (!chip_id_loaded) {
        uint8_t mac[6];
        esp_err_t ret = esp_efuse_mac_get_default(mac);
        if (ret == ESP_OK) {
            // Convert MAC address (last 6 bytes) to hex string
            snprintf(chip_id_str, sizeof(chip_id_str), "%02X%02X%02X%02X%02X%02X", 
                     mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        } else {
            snprintf(chip_id_str, sizeof(chip_id_str), "UNKNOWN");
            ESP_LOGE(TAG, "Failed to read chip ID: %s", esp_err_to_name(ret));
        }
        chip_id_loaded = true;
        ESP_LOGI(TAG, "ESP32 Chip ID: %s", chip_id_str);
    }
    return chip_id_str;
}

// Function to publish sensor data to MQTT broker
// This function will be expanded to create and send the two JSON messages
void publish_input_data_mqtt(const input_data_t *input_data_ptr) {
    if (debug_logging) printf("[DEBUG] publish_input_data_mqtt() called\n");
    
    if (!mqtt_client) {
        ESP_LOGE(TAG, "MQTT client not initialized!");
        if (debug_logging) printf("[DEBUG] MQTT client not initialized - returning\n");
        return;
    }

    ESP_LOGI(TAG, "Preparing to publish input data via MQTT...");

    // PutOutputFormattingForMqttHere: Replace this JSON creation with your specific format
    // Create JSON with your specific data structure
    cJSON *root = cJSON_CreateObject();
    if (!root) {
        ESP_LOGE(TAG, "Failed to create cJSON root object.");
        return;
    }

    // Add processor metrics data first (system information)
    cJSON *processor_root = cJSON_CreateObject();
    if (processor_root) {
        // WiFi RSSI as percentage
        int32_t wifi_rssi_percent = get_wifi_rssi_percent();
        cJSON_AddNumberToObject(processor_root, "WiFiRSSI", wifi_rssi_percent);
        
        // IP Address
        char *ip_address = get_ip_address();
        cJSON_AddStringToObject(processor_root, "IPAddress", ip_address);
        
        // CPU Temperature
        float cpu_temp = get_cpu_temperature();
        cJSON_AddNumberToObject(processor_root, "CPUTemperature", cpu_temp);
        
        // Software Version
        char *software_version = get_software_version();
        cJSON_AddStringToObject(processor_root, "SoftwareVersion", software_version);
        
        // ESP32 Chip ID
        char *chip_id = get_chip_id();
        cJSON_AddStringToObject(processor_root, "ChipID", chip_id);
        
        // Watchdog Restart Count
        cJSON_AddNumberToObject(processor_root, "WDTRestartCount", watchdog_reset_counter);
        
        cJSON_AddItemToObject(root, "processor", processor_root);
    }

    // PutOutputFormattingForMqttHere: Add your specific data formatting here
    // BH1750 light sensor data
    cJSON *data_root = cJSON_CreateObject();
    if (data_root) {
        // BH1750 light sensor data fields
        cJSON_AddNumberToObject(data_root, "sunlight", input_data_ptr->sunlight);
        cJSON_AddBoolToObject(data_root, "sensor_ok", input_data_ptr->sensor_ok);
        
        // PutOutputFormattingForMqttHere: Add more fields as needed
        // The sunlight field contains the light intensity in lux units
        // The sensor_ok field indicates if the sensor reading was successful
        
        cJSON_AddItemToObject(root, "data", data_root);
    }

    // Publish as a single topic
    char *json_string = cJSON_PrintUnformatted(root);
    if (json_string == NULL) {
        ESP_LOGE(TAG, "Failed to print combined cJSON to string.");
    } else {
        char topic[64];
        // Use data_topic directly (you may want to rename this variable for your use case)
        snprintf(topic, sizeof(topic), "%s", data_topic);
        if (debug_logging) printf("[DEBUG] About to publish to topic: %s\n", topic);
        if (debug_logging) printf("[DEBUG] JSON payload length: %d\n", strlen(json_string));
        esp_mqtt_client_publish(mqtt_client, topic, json_string, 0, 1, 0);
        ESP_LOGI(TAG, "Published to %s (length: %d)", topic, strlen(json_string));
        free(json_string);
    }
    cJSON_Delete(root);
}

// Helper to convert hex char to int
int hex2int(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    return 0;
}

// URL decode utility (in-place)
void url_decode(char *dst, const char *src, size_t dstsize) {
    char a, b;
    size_t i = 0, j = 0;
    while (src[i] && j + 1 < dstsize) {
        if (src[i] == '%' && src[i+1] && src[i+2]) {
            if ((a = src[i+1]) && (b = src[i+2])) {
                dst[j++] = hex2int(a) * 16 + hex2int(b);
                i += 3;
            } else {
                dst[j++] = src[i++];
            }
        } else if (src[i] == '+') {
            dst[j++] = ' ';
            i++;
        } else {
            dst[j++] = src[i++];
        }
    }
    dst[j] = '\0';
}

// DNS hijack task for captive portal
void dns_hijack_task(void *pvParameter) {
    // Remove from watchdog to prevent conflicts during configuration mode
    // esp_task_wdt_add(NULL);
    
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (sock < 0) {
        ESP_LOGE(TAG, "Failed to create DNS socket: errno=%d", errno);
        vTaskDelete(NULL);
        return;
    }
    
    // Set socket options for better reliability
    int reuse = 1;
    if (setsockopt(sock, SOL_SOCKET, SO_REUSEADDR, &reuse, sizeof(reuse)) < 0) {
        ESP_LOGW(TAG, "Failed to set SO_REUSEADDR: errno=%d", errno);
    }
    
    struct sockaddr_in server_addr;
    memset(&server_addr, 0, sizeof(server_addr));
    server_addr.sin_family = AF_INET;
    server_addr.sin_port = htons(53);
    server_addr.sin_addr.s_addr = htonl(INADDR_ANY);
    
    if (bind(sock, (struct sockaddr *)&server_addr, sizeof(server_addr)) < 0) {
        ESP_LOGE(TAG, "Failed to bind DNS socket: errno=%d", errno);
        close(sock);
        vTaskDelete(NULL);
        return;
    }
    
    ESP_LOGI(TAG, "DNS hijack server started on UDP port 53");
    
    uint8_t buf[512];
    struct sockaddr_in client_addr;
    socklen_t addr_len = sizeof(client_addr);
    uint32_t dns_requests_handled = 0;
    
    // Set a more reasonable timeout
    struct timeval timeout;
    timeout.tv_sec = 5;  // Increased to 5 seconds
    timeout.tv_usec = 0;
    if (setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout)) < 0) {
        ESP_LOGW(TAG, "Failed to set socket timeout: errno=%d", errno);
    }
    
